## Задача №2:
#
# Ганс Грубер в это время пытается намайнить биткоины - чтобы сделать это ему нужно найти MD5 хэши,
# которые начинаются как минимум с 5 нулей.
# Значение, хэш которого нужно посчитать - это инпут (пользовательский ввод), за которым следует положительное число (1, 2, 3 итд).
#
# Например, для инпута abcdef результатом будет число 609043, потому что MD5 хэш для abcdef609043 начинается с 5 нулей (000001dbbfa...)
# и это минимальное такое число.
#
# Помогите Гансу найти это число.1
#
# Требования к решению:
# - Инпут вводится пользователем (получение данных в коде через команду gets)
# - Результат (число) выводится через puts
#
#
## Решение:
require 'digest'
md5 = Digest::MD5.new
user_input = gets.chomp
for i in (1..999999999999) do
  md5 << user_input
  md5 << i.to_s
  hex_array = md5.to_s.split("")
  if ((hex_array[0] == '0') && (hex_array[1] == '0') && (hex_array[2] == '0') &&
      (hex_array[3] == '0') && (hex_array[4] == '0'))
    puts i
    break
  end
  md5 = md5.reset
end
